# 1、准备商品
shop1 = [
    print("电脑")
    ["华硕",4500]
    ["神州",5500]
    ["联想",3000]
    ["机械师",6000]
    ["雷神",6500]
    ["ipad",3500]
    ["MAC",18000]
    ["天河一号",2000000000000000]
]
shop2 = [
    print("手表")
    ["天王",150000]
    ["劳力士",2000000]
    ["百达翡丽",1000000000]
    ["江诗丹顿",500000000]
    ["宝玑",100000000]
    ["卡地亚",15000000]
]
shop3 =[
    print("手机")
    ["小米",3499]
    ["oppo",2999]
    ["魅族",3299]
    ["一加",3199]
    ["红米",2499]
    ["华为",5499]
    ["黑鲨",3299]
    ["苹果",5199]
]
shop4 = [
    print("水果")
    ["苹果",4]
    ["梨",6]
    ["香蕉",4.5]
    ["车厘子",45]
    ["芒果",7]
]

# 2、初始化钱包
money = int(input("请输入您的余额"))

#3、空的购物车
mycart = []

# 4、 买东西
i = 1
# while i <=50:
    # for key,value in enumerate(shop1,shop2,shop3,shop4):
    #